@copilot 

I am trying to use this package locally; I have the following configuration, and I expect this to use the configuration in my `~/.ssh/config` file. Fix the implementation so that this works:

```main.tf
...

provider "scp" {
  host = "hephaestus"
}

resource "scp_file" "test_file" {
  content  = "Hello from OpenTofu"
  filename = "/home/igor/tf-test/hello.txt"

  file_permission      = "0644"
  directory_permission = "0755"
}

...
```

`~/.ssh/config`:
```
AddKeysToAgent yes
UseKeychain yes
IdentityFile ~/.ssh/id_ed25519

Host hephaestus
  HostName 192.168.1.100
  User igor
```

```
$> tofu apply -auto-approve
╷
│ Warning: Provider development overrides are in effect
│ 
│ The following provider development overrides are set in the CLI configuration:
│  - igorlabworks/scp in /Users/igor/Documents/dev/terraform-provider-scp-file
│ 
│ The behavior may therefore not match any released version of the provider and applying changes may cause the state to become incompatible with
│ published releases.
╵
data.terraform_remote_state.shared_constants: Reading...
data.terraform_remote_state.shared_constants: Read complete after 0s

OpenTofu used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # scp_file.test_file will be created
  + resource "scp_file" "test_file" {
      + content              = "Hello from OpenTofu"
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "/home/igor/tf-test/hello.txt"
      + id                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + configuration_path  = "environments/local/infrastructure/service-management/hephaestus"
  + s3_backend_config   = (sensitive value)
  + test_file_checksums = {
      + md5    = (known after apply)
      + sha1   = (known after apply)
      + sha256 = (known after apply)
    }
scp_file.test_file: Creating...
╷
│ Error: Create SCP file error
│ 
│   with scp_file.test_file,
│   on 30-main.tf line 1, in resource "scp_file" "test_file":
│    1: resource "scp_file" "test_file" {
│ 
│ An unexpected error occurred while writing the remote file
│ 
│ Original Error: no SSH authentication methods available
╵
```

(Note: I have renamed the package)